#include "pch.h"
#include "lib/include/Pattern.h"

using namespace Gomoku;
using namespace std;

class EvaluatorTest : public ::testing::Test {
protected:
    Evaluator ev;
};

// 触发过BUG的测试用例：

/*

  0 1 2 3 4 5 6 7 8 9 a b c d e
0 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
1 _ _ _ _ _ _ _ _ _ x _ _ _ _ _
2 _ _ _ _ _ o _ _ o _ o _ _ _ _
3 _ _ _ _ _ _ x o o o o x _ _ _
4 _ _ _ _ _ x o o o x x x x _ _
5 _ _ _ _ o o x x x o x o _ _ _
6 _ _ _ _ x o x x x o x x o _ _
7 _ _ _ o x x x x o x o _ x _ _
8 _ _ _ _ o o o x o _ x o _ o _
9 _ _ _ _ _ x o o x _ x o x _ _
a _ _ _ _ _ _ o _ _ x _ _ _ _ _
b _ _ _ _ _ _ _ _ _ _ o _ _ _ _
c _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
d _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
e _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

(9, 2)为"^o__o^"与"~_o_o_~"两个模式的有效重叠点。
这导致了(6, 2)点在更新时出现了一系列的bug。

*/

/*

  0 1 2 3 4 5 6 7 8 9 a b c d e 
0 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
1 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
2 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
3 _ _ _ _ _ _ _ o _ _ _ _ _ _ _ 
4 _ _ _ _ _ _ o x x _ _ _ _ _ _ 
5 _ _ _ _ _ x o x o o _ _ _ _ _ 
6 _ _ _ _ o o o x x _ o _ _ _ _ 
7 _ _ _ _ _ o x x x x o _ _ _ _ 
8 _ _ _ _ _ x o o x x o _ _ _ _
9 _ _ _ _ x _ _ x _ _ x _ _ _ _ 
a _ _ _ _ _ _ _ _ _ _ _ o _ _ _ 
b _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
c _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
d _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
e _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 

相较于上例为更复杂的情况。(8, 9)点是三个模式（9行2活二，8列1眠三）的交汇点。

*/

/*

  0 1 2 3 4 5 6 7 8 9 a b c d e
0 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
1 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
2 _ _ _ _ _ _ o _ _ _ _ _ _ _ _
3 _ _ _ _ _ _ _ o _ _ _ _ _ _ _
4 _ _ _ _ _ _ o x o _ _ _ _ _ _
5 _ _ _ _ _ x o x o _ _ _ _ _ _
6 _ _ _ _ o o o x x _ o _ _ _ _
7 _ _ _ _ _ o x x x x o x _ _ _
8 _ _ _ _ _ x o o x x _ _ _ _ _
9 _ _ _ _ _ _ _ x _ _ _ _ _ _ _
a _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
b _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
c _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
d _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
e _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

触发的BUG：(6, 2)在下棋后分数不为0
原因：由于下在(b, 7)的黑子离(6, 2)的距离超过了TARGET_LEN / 2，
      故在AC自动机搜索时，根本没搜出来(4, 0)->(9, 5)的"~__oo~"模式，从而没有删去(6, 2)的分数。
解决方案：修改AC自动机，设定"_oo~o_"模式为"DeadThree"

*/

/*

  0 1 2 3 4 5 6 7 8 9 a b c d e 
0 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
1 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
2 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
3 _ _ _ _ _ _ o _ _ _ _ _ _ _ _ 
4 _ _ _ _ _ o o o x _ _ _ _ _ _ 
5 _ _ _ _ _ _ x x o x _ _ _ _ _ 
6 _ _ _ _ _ x o x x x o _ _ _ _ 
7 _ _ _ _ _ _ o x x x _ _ _ _ _ 
8 _ _ _ _ _ o o o x o _ _ _ _ _ 
9 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
a _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
b _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
c _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
d _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
e _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 


*/